client/results/rq2/h1/stresstest/client_4/summary.txt
starting benchmark...
spawning thread #0: 2 total client(s). 25000 total requests
spawning thread #1: 2 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 21.45s, 2331.39 req/s, 10.22MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      442us     17.12ms      1.56ms       725us    83.31%
time for connect:    12.80ms     17.31ms     14.62ms      1.91ms    75.00%
time to 1st byte:    17.91ms     21.04ms     19.80ms      1.40ms    75.00%
req/s           :     582.84      698.15      640.46       63.57   100.00%