client/results/rq2/h1/stresstest/client_4/summary.txt
starting benchmark...
spawning thread #0: 2 total client(s). 25000 total requests
spawning thread #1: 2 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 15.71s, 3182.81 req/s, 13.95MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      389us     10.38ms      1.23ms       577us    82.45%
time for connect:     4.84ms     15.22ms      8.64ms      4.54ms    75.00%
time to 1st byte:     8.72ms     17.09ms     14.05ms      3.90ms    75.00%
req/s           :     795.74      819.77      807.66       12.70   100.00%